Repository: igoraresti/EuskalIA
Catalog: server/EuskalIA.Server/Resources/Controllers/UsersController.*.resx
Languages: eu, pl

# InvalidCredentials
source: Invalid username or password
eu: Erabiltzailea edo pasahitza okerra
pl: Nieprawidłowa nazwa użytkownika lub hasło

# EmailNotVerified
source: Please verify your email address before logging in
eu: Mesedez, egiaztatu zure posta elektronikoa saioa hasi aurretik
pl: Proszę zweryfikować adres e-mail przed zalogowaniem

# AccountDeactivated
source: This account has been deactivated.
eu: Kontu hau desgaituta dago.
pl: To konto zostało dezaktywowane.

# RegistrationSuccess
source: Registration successful. Please verify your email.
eu: Erregistro arrakastatsua. Mesedez, egiaztatu zure posta elektronikoa.
pl: Rejestracja zakończona sukcesem. Proszę zweryfikować e-mail.

# EmailAlreadyRegistered
source: The email address is already registered
eu: Posta elektronikoa dagoeneko erregistratuta dago
pl: Adres e-mail jest już zarejestrowany

# UsernameTaken
source: The username is already in use
eu: Erabiltzaile izena dagoeneko erabiltzen ari da
pl: Nazwa użytkownika jest już zajęta

# AllFieldsRequired
source: All fields are required
eu: Eremu guztiak nahitaezkoak dira
pl: Wszystkie pola są wymagane

source: Invalid email format
eu: Posta elektronikoaren formatu baliogabea
pl: Nieprawidłowy format e-mail

# PasswordTooShort
source: The password must be at least 6 characters long
eu: Pasahitzak gutxienez 6 karaktere izan behar ditu
pl: Hasło musi mieć co najmniej 6 znaków

# TokenInvalid
source: Invalid token
eu: Token baliogabea
pl: Nieprawidłowy token

# TokenExpired
source: Token has expired
eu: Tokena iraungi da
pl: Token wygasł

source: Token invalid or expired
eu: Token baliogabea edo iraungia
pl: Nieprawidłowy lub wygasły token

# DeactivationEmailSent
source: Deactivation request sent. Please check your email.
eu: Desgaitzeko eskaera bidali da. Egiaztatu zure posta elektronikoa.
pl: Wysłano prośbę o dezaktywację. Sprawdź e-mail.

# ProfileUpdated
source: Profile updated successfully
eu: Profila ondo eguneratu da
pl: Profil został zaktualizowany

# LanguageUpdated
source: Language updated successfully
eu: Hizkuntza ondo eguneratu da
pl: Język został zaktualizowany

source: Invalid language
eu: Hizkuntza baliogabea
pl: Nieprawidłowy język
